In [2]:
import time
from functools import wraps
from typing import Callable, Any
from time import sleep


def retry(retries: int = 3, delay: float = 1) -> Callable:
    """
    Attempt to call a function, if it fails, try again with a specified delay.

    :param retries: The max amount of retries you want for the function call
    :param delay: The delay (in seconds) between each function retry
    :return:
    """

    # Don't let the user use this decorator if they are high
    if retries < 1 or delay <= 0:
        raise ValueError('Are you high, mate?')

    def decorator(func: Callable) -> Callable:
        @wraps(func)
        def wrapper(*args, **kwargs) -> Any:
            for i in range(1, retries + 1):  # 1 to retries + 1 since upper bound is exclusive

                try:
                    print(f'Running ({i}): {func.__name__}()')
                    return func(*args, **kwargs)
                except Exception as e:
                    # Break out of the loop if the max amount of retries is exceeded
                    if i == retries:
                        print(f'Error: {repr(e)}.')
                        print(f'"{func.__name__}()" failed after {retries} retries.')
                        break
                    else:
                        print(f'Error: {repr(e)} -> Retrying...')
                        sleep(delay)  # Add a delay before running the next iteration

        return wrapper

    return decorator


@retry(retries=3, delay=1)
def connect() -> None:
    time.sleep(1)
    raise Exception('Could not connect to internet...')


def main() -> None:
    connect()


if __name__ == '__main__':
    main()

Running (1): connect()
Error: Exception('Could not connect to internet...') -> Retrying...
Running (2): connect()
Error: Exception('Could not connect to internet...') -> Retrying...
Running (3): connect()
Error: Exception('Could not connect to internet...').
"connect()" failed after 3 retries.

In [1]:
import time 
def connect()-> None:
    time.sleep(1)
    raise Exception('Could not connect ... ')

In [6]:
import pandas as pd
df = pd.DataFrame(
    {
    'sr':[1,2,3,4,5,6],
    'day':['Monday', 'Tuesday', 'Thusday', 'Thusday', 'Thursday', 'Thusday']
    }
)
df

   sr       day
0   1    Monday
1   2   Tuesday
2   3   Thusday
3   4   Thusday
4   5  Thursday
5   6   Thusday

In [7]:
df['day'] = df['day'].str.replace('Thusday', 'Thursday')
df

   sr       day
0   1    Monday
1   2   Tuesday
2   3  Thursday
3   4  Thursday
4   5  Thursday
5   6  Thursday

In [8]:
df.isnull().sum()

sr     0
day    0
dtype: int64

In [9]:
df = pd.read_csv(r'C:\Users\anshu\OneDrive\Code\Python\Python\Developer\018_Introduction_to_Testing_in_Python\Datasets\energy_truncated.csv')
df.head()

,COUNTRY,CODE_TIME,TIME,YEAR,MONTH,MONTH_NAME,PRODUCT,VALUE,DISPLAY_ORDER,yearToDate,previousYearToDate,share
0,Korea,MAY2013,May 2013,2013,5,May,Final consumption,39473.035000,20,4.977509e+05,2.051108e+05,0.954033
1,IEA Total,FEB2016,February 2016,2016,2,February,Natural gas,211339.729825,10,2.795270e+06,4.333656e+05,0.247120
2,India,DEC2018,December 2018,2018,12,December,Electricity supplied,123155.012250,17,1.519538e+06,1.405865e+06,1.000000
3,Mexico,MAR2011,March 2011,2011,3,March,Oil,3417.958000,9,4.496532e+04,9.899519e+03,0.146939
4,Denmark,JAN2022,January 2022,2022,1,January,Total exports,1654.782877,16,1.736937e+04,1.150371e+03,0.424906

In [10]:
df.drop('previousYearToDate', axis=1, inplace=True)

In [11]:
df = df.groupby('COUNTRY')\
            .agg({'VALUE': 'sum'})

In [14]:
df.isnull().sum().sum()

0

In [34]:
path = r'C:\Users\anshu\Downloads'
file = 'subject.csv'
subject_df = pd.read_csv(path+'/'+file)
subject_df['duplicate_id'] = subject_df.duplicated(subset=['work_id'])
dups = list(subject_df[subject_df['duplicate_id']==True]['work_id'])

In [35]:
subject_df[subject_df['work_id'].isin(dups)].sort_values(by='work_id')

      work_id        subject  duplicate_id
3714      389        Gardens          True
3713      389        Flowers         False
3723      414         Lovers          True
3722      414        Gardens         False
6483      466        Bridges         False
...       ...            ...           ...
978    204878   Christianity         False
1410   207471  Landscape Art         False
1411   207471         Winter          True
4923   207522    Autumn/Fall         False
4924   207522  Landscape Art          True

[1497 rows x 3 columns]

In [36]:
path = r'C:\Users\anshu\Downloads'
file = 'work.csv'
work_df = pd.read_csv(path+'/'+file)
work_df['duplicate_id'] = work_df.duplicated(subset=['work_id'])
dups = list(work_df[work_df['duplicate_id']==True]['work_id'])

In [37]:
work_df[work_df['work_id'].isin(dups)].sort_values(by='work_id')

,work_id,name,artist_id,style,museum_id,duplicate_id
1135,122662,The Dunes at Camiers,862,Realism,NaN,False
11103,122662,The Dunes at Camiers,862,Realism,NaN,True
1130,122691,Landscape with a Sunlit Stream,862,Realism,NaN,False
11061,122691,Landscape with a Sunlit Stream,862,Realism,NaN,True
5878,181318,"Maroon, Pink and Shade of Red",770,NaN,NaN,False
...,...,...,...,...,...,...
8152,181925,Light Blue and Pink,770,NaN,NaN,True
5897,181932,"Purple, White Stripe on Soft Orange",770,NaN,NaN,False
12233,181932,"Purple, White Stripe on Soft Orange",770,NaN,NaN,True
12194,181941,"Blue Stripe, Orange Shades",770,NaN,NaN,True
5859,181941,"Blue Stripe, Orange Shades",770,NaN,NaN,False

In [1]:
num: float = 10000.123456
text: str = 'SAMPLE'

In [7]:
print(f'{text:<20}')
print(f'{text:>20}')
print(f'{text:^20}')
print(f'{text:_<20}')
print(f'{text:_>20}')
print(f'{text:.^20}')

SAMPLE
              SAMPLE
       SAMPLE
SAMPLE______________
______________SAMPLE
.......SAMPLE.......

In [11]:
print(f'{num:.2f}')
print(f'{num:_.2f}')
print(f'{num:,.2f}')
print(f'{num:#.2f}')
print(f'{num:_.2%}')

10000.12
10_000.12
10,000.12
10000.12
1_000_012.35%

In [12]:
num = 1_000_000
print(f'{num:.0e}')

1e+06

In [13]:
import datetime as dtt

current_date = dtt.datetime.now()
print(f'{current_date:%d-%B-%Y}')

17-April-2024

E3g#7S+m)PW382)